#### pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1=pd.DataFrame({'a':[1,3,7,4],'b':[17,86,52,68],'c':[134,874,592,246]})
df1

   a   b    c
0  1  17  134
1  3  86  874
2  7  52  592
3  4  68  246

# 1. map (Series)

In [3]:
f1=lambda x:'%03d'%x

In [4]:
list(map(f1, df1['b']))

['017', '086', '052', '068']

In [5]:
df1['b'].map(f1)

0    017
1    086
2    052
3    068
Name: b, dtype: object

# 2. apply (DataFrame)

In [6]:
f2=lambda x:x.max()-x.min()

In [7]:
df1.apply(f2)

a      6
b     69
c    740
dtype: int64

In [8]:
df1.apply(f2, axis=1)

0    133
1    871
2    585
3    242
dtype: int64

In [9]:
df1.apply(sum, 1)

0    152
1    963
2    651
3    318
dtype: int64

In [10]:
round(df1.apply(np.mean,1),2)

0     50.67
1    321.00
2    217.00
3    106.00
dtype: float64

In [11]:
f3=lambda x:pd.Series([x.min(), x.max()], index=['min', 'max'])
df1.apply(f3)

     a   b    c
min  1  17  134
max  7  86  874

# 3. applymap (DataFrame)

In [12]:
f4=lambda x:'%03d'%x

In [13]:
df1.applymap(f4)

     a    b    c
0  001  017  134
1  003  086  874
2  007  052  592
3  004  068  246